In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [ ]:
# Pandas 41 | Agregasi pada banyak kolom Data Frame dengan agg

In [ ]:
df =  pd.read_csv('./data/titanicfull.csv')
df.head()

In [ ]:
# Menerapkan agregasi pada sejumlah kolom dengan agg()

In [ ]:
df.groupby('pclass').agg({'pclass': 'count',
                         'age':['mean', 'max'],
                         'survived': 'mean'})

In [ ]:
df.groupby('pclass').agg(n_pass=('pclass', 'count'),
                        avg_age=('age', 'mean'),
                        max_age=('age', 'max'),
                        survival_rate=('survived', 'mean'))

In [2]:
# Pandas 42 | Mengurutkan data kolom pada Data Frame

In [ ]:
df =  pd.read_csv('./data/titanicfull.csv')
df.head()

In [ ]:
# Mengurutkan data berdasarkan kolom tertentu

In [ ]:
df.sort_values('age').head()

In [ ]:
df.sort_values('age', ascending=False).head()

In [ ]:
df.sort_values(['survived', 'age']).head()

In [ ]:
# Pandas 43 | Menangani whitespace pada Pandas Data Frame

In [3]:
data = {'nim' : ['10', '11', '12', '13', '  '],
       'nama' : ['adi', '  ', 'tejo', '  ', 'bejo']}

df = pd.DataFrame(data)
df

  nim  nama
0  10   adi
1  11
2  12  tejo
3  13
4      bejo

In [ ]:
# Menangani whitesspace pada Data Frame

In [4]:
df

  nim  nama
0  10   adi
1  11
2  12  tejo
3  13
4      bejo

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nim     5 non-null      object
 1   nama    5 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes

In [6]:
df = df.replace(r'^\s*$', np.nan, regex = True)
df

   nim  nama
0   10   adi
1   11   NaN
2   12  tejo
3   13   NaN
4  NaN  bejo

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nim     4 non-null      object
 1   nama    3 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes

In [ ]:
# Pandas 44 | Menata ulang kolom pada Data Frame

In [8]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size = (n_rows, n_cols)),
                 columns = cols)
df

   A  B  C  D  E
0  6  5  2  7  1
1  7  3  7  2  6
2  2  7  5  7  3
3  3  4  4  5  6
4  6  4  9  6  7

In [9]:
# Menata ulang penempatan kolom pada Data Frame

In [10]:
df[['D', 'C', 'A', 'E', 'B']]

   D  C  A  E  B
0  7  2  6  1  5
1  2  7  7  6  3
2  7  5  2  3  7
3  5  4  3  6  4
4  6  9  6  7  4

In [12]:
df

   A  B  C  D  E
0  6  5  2  7  1
1  7  3  7  2  6
2  2  7  5  7  3
3  3  4  4  5  6
4  6  4  9  6  7

In [14]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

   D  C  A  E  B
0  7  2  6  1  5
1  2  7  7  6  3
2  7  5  2  3  7
3  5  4  3  6  4
4  6  9  6  7  4